Конфигурация/InformationRegisters/ПлановыеДатыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеДатыОплат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Сделка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>InformationRegister.УсловияСделок</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.РаспределенияАктивовЕПС</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРасчетовНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимБиржевыхТоргов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыБиржевыхТоргов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеполныеЛоты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПереговорныхСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыкупЭмитентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Comment>При установленном флаге документ создает задолженность по ц/б и д/с, при сброшенном — двигает остатки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Comment>Оплата и поставка при отложенном исполнении планируются в разные дни</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплатаТорговойКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыТорговойКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаТорговойКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Comment>Для внебиржевых сделок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретениеПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПорученияУБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияУБрокера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ПлановыеДатыОплат/Ext/ManagerModule.bsl
Процедура СформироватьДвижения(Регистратор) Экспорт
	
	Регистратор.Движения.ПлановыеДатыОплат.Записывать = Истина;
	Регистратор.Движения.ПлановыеДатыОплат.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	
	Если ТипЗнч(Регистратор) = Тип("ДокументОбъект.Сделка")
		ИЛИ ТипЗнч(Регистратор) = Тип("ДокументОбъект.СделкаРЕПО") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.Ссылка.Дата КАК Период,
			|	СделкаЦенныеБумаги.Ссылка КАК Регистратор,
			|	СделкаЦенныеБумаги.Ссылка.Организация КАК Организация,
			|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии) КАК ВидЗадолженности,
			|	СделкаЦенныеБумаги.Ссылка.ВалютаТорговойКомиссии КАК Валюта,
			|	СделкаЦенныеБумаги.Ссылка КАК Основание,
			|	ВЫБОР
			|		КОГДА СделкаЦенныеБумаги.Ссылка.ОтложеннаяОплатаТорговойКомиссии
			|			ТОГДА СделкаЦенныеБумаги.Ссылка.ДатаОплатыТорговойКомиссии
			|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка.Дата
			|	КОНЕЦ КАК ДатаОплаты
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкаЦенныеБумаги.Ссылка.Организация,
			|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления,
			|	СделкаЦенныеБумаги.Ссылка.ВалютаТорговойКомиссии,
			|	СделкаЦенныеБумаги.Ссылка,
			|	ВЫБОР
			|		КОГДА СделкаЦенныеБумаги.Ссылка.ОтложеннаяОплатаТорговойКомиссии
			|			ТОГДА СделкаЦенныеБумаги.Ссылка.ДатаОплатыТорговойКомиссии
			|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка.Дата
			|	КОНЕЦ,
			|	СделкаЦенныеБумаги.Ссылка.Дата,
			|	СделкаЦенныеБумаги.Ссылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(СделкаЦенныеБумаги.ТорговаяКомиссия) > 0";
		
		Если ТипЗнч(Регистратор) = Тип("ДокументОбъект.СделкаРЕПО") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка", "Документ.СделкаРЕПО");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.СделкаСВалютой") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаСВалютой.Дата КАК Период,
			|	СделкаСВалютой.Ссылка КАК Регистратор,
			|	СделкаСВалютой.Организация КАК Организация,
			|	СделкаСВалютой.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии) КАК ВидЗадолженности,
			|	СделкаСВалютой.ВалютаКомиссии КАК Валюта,
			|	СделкаСВалютой.Ссылка КАК Основание,
			|	ВЫБОР
			|		КОГДА СделкаСВалютой.ОтложеннаяОплатаКомиссии
			|			ТОГДА СделкаСВалютой.ДатаОплатыКомиссии
			|		ИНАЧЕ СделкаСВалютой.Дата
			|	КОНЕЦ КАК ДатаОплаты
			|ИЗ
			|	Документ.СделкаСВалютой КАК СделкаСВалютой
			|ГДЕ
			|	СделкаСВалютой.Ссылка = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкаСВалютой.Дата,
			|	СделкаСВалютой.Ссылка,
			|	СделкаСВалютой.Организация,
			|	СделкаСВалютой.СчетДоверительногоУправления,
			|	СделкаСВалютой.ВалютаКомиссии,
			|	СделкаСВалютой.Ссылка,
			|	ВЫБОР
			|		КОГДА СделкаСВалютой.ОтложеннаяОплатаКомиссии
			|			ТОГДА СделкаСВалютой.ДатаОплатыКомиссии
			|		ИНАЧЕ СделкаСВалютой.Дата
			|	КОНЕЦ
			|
			|ИМЕЮЩИЕ
			|	СделкаСВалютой.СуммаКомиссии > 0";
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.НачислениеЗадолженности") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НачислениеЗадолженностиОснования.Ссылка.Дата КАК Период,
			|	НачислениеЗадолженностиОснования.Ссылка КАК Регистратор,
			|	НачислениеЗадолженностиОснования.Ссылка.Организация КАК Организация,
			|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|	НачислениеЗадолженностиОснования.Ссылка.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА НачислениеЗадолженностиОснования.Основание = НЕОПРЕДЕЛЕНО
			|			ТОГДА НачислениеЗадолженностиОснования.Ссылка
			|		ИНАЧЕ НачислениеЗадолженностиОснования.Основание
			|	КОНЕЦ КАК Основание,
			|	НачислениеЗадолженностиОснования.ДатаОплаты КАК ДатаОплаты
			|ИЗ
			|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
			|ГДЕ
			|	НачислениеЗадолженностиОснования.Ссылка = &Регистратор
			|	И НачислениеЗадолженностиОснования.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)";
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.Оплата") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОплатаОснования.Ссылка.Дата КАК Период,
			|	ОплатаОснования.Ссылка КАК Регистратор,
			|	ОплатаОснования.Ссылка.Организация КАК Организация,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|	ОплатаОснования.Валюта КАК Валюта,
			|	ОплатаОснования.Ссылка КАК Основание,
			|	ОплатаОснования.Ссылка.ДатаПлановогоПогашенияЗадолженности КАК ДатаОплаты
			|ИЗ
			|	Документ.Оплата.Основания КАК ОплатаОснования
			|ГДЕ
			|	ОплатаОснования.Ссылка = &Регистратор
			|	И ОплатаОснования.Ссылка.Аванс
			|	И ОплатаОснования.Ссылка.ДатаПлановогоПогашенияЗадолженности <> ДАТАВРЕМЯ(1, 1, 1)";
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.ОперацияНДС") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДвиженияЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности
			|ПОМЕСТИТЬ _ИтогКварталаНДС
			|ИЗ
			|	&ДвиженияЗадолженностиПоДенежнымСредствам КАК ДвиженияЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ДвиженияЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОперацияНДС.Дата КАК Период,
			|	ОперацияНДС.Ссылка КАК Регистратор,
			|	ОперацияНДС.Организация КАК Организация,
			|	ОперацияНДС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость) КАК ВидЗадолженности,
			|	&Рубли КАК Валюта,
			|	ОперацияНДС.Ссылка КАК Основание,
			|	ВЫБОР
			|		КОГДА _ИтогКварталаНДС.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|			ТОГДА &ДатаУплатыКредиторкиНДС
			|		ИНАЧЕ &ДатаУплатыДебиторкиНДС
			|	КОНЕЦ КАК ДатаОплаты
			|ИЗ
			|	Документ.ОперацияНДС КАК ОперацияНДС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ИтогКварталаНДС КАК _ИтогКварталаНДС
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ОперацияНДС.Ссылка = &Регистратор";
		
		Запрос.УстановитьПараметр("Рубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
		Запрос.УстановитьПараметр("ДвиженияЗадолженностиПоДенежнымСредствам", Регистратор.Движения.ЗадолженностиПоДенежнымСредствам);
		Запрос.УстановитьПараметр("ДатаУплатыКредиторкиНДС", РаботаСНДС.ПолучитьСрокОплатыНДС(Регистратор.Дата, Справочники.ВидыЗадолженности.НДСТекущегоПериода, Перечисления.ТипыЗадолженности.Кредиторская));
		Запрос.УстановитьПараметр("ДатаУплатыДебиторкиНДС", РаботаСНДС.ПолучитьСрокОплатыНДС(Регистратор.Дата, Справочники.ВидыЗадолженности.НДСТекущегоПериода, Перечисления.ТипыЗадолженности.Дебиторская));
		
	КонецЕсли;
	
	Регистратор.Движения.ПлановыеДатыОплат.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
